[
  {
    "category": "Property",
    "situations": [
      {
        "title": "Claim Denied – Wear & Tear",
        "summary": "Request insurer's engineering report; supply roofer's statement proving sudden damage.",
        "document": "Appeal Letter",
        "details": "When insurers deny claims citing 'wear and tear,' they must provide specific evidence. Request their engineering report and obtain a professional roofer's statement documenting sudden damage versus gradual deterioration."
      },
      {
        "title": "Lowball Estimate",
        "summary": "Compare insurer vs contractor scope; list omitted items; request reinspection.",
        "document": "Demand Letter",
        "details": "Systematically compare the insurer's estimate with contractor estimates. Document all omitted items, code upgrades, and scope differences. Request a reinspection with your contractor present."
      },
      {
        "title": "No Response for 30+ Days",
        "summary": "Send Notice of Delay citing statutory timelines (14/30 days).",
        "document": "Notice of Delay Complaint",
        "details": "Most states require insurers to acknowledge claims within 14 days and provide coverage decisions within 30 days. Send a formal Notice of Delay citing your state's specific timeline requirements."
      },
      {
        "title": "Partial Payment",
        "summary": "Summarize unpaid items; request written explanations.",
        "document": "Coverage Clarification Request",
        "details": "When insurers make partial payments, request written explanations for all unpaid items. Document the specific coverage decisions and challenge any improper exclusions."
      },
      {
        "title": "Depreciation Dispute",
        "summary": "Ask for ACV vs RCV calculation; show repair invoices to release holdback.",
        "document": "Proof of Repairs Submission",
        "details": "Understand the difference between Actual Cash Value (ACV) and Replacement Cost Value (RCV). Provide repair invoices to release depreciation holdbacks and maximize your settlement."
      },
      {
        "title": "Code Upgrade Denial",
        "summary": "Cite ordinance/law coverage; provide building department requirements.",
        "document": "Ordinance & Law Coverage Request",
        "details": "Most policies include ordinance and law coverage for code upgrades. Obtain building department requirements and cite specific policy language supporting coverage for mandatory upgrades."
      },
      {
        "title": "Matching Issues",
        "summary": "Document visible differences; cite matching coverage language.",
        "document": "Matching Coverage Request",
        "details": "When insurers refuse to pay for matching materials, document visible differences and cite your policy's matching coverage language. This is often covered under 'consequential damage' provisions."
      },
      {
        "title": "Betterment Charges",
        "summary": "Challenge as improper; request detailed breakdown of charges.",
        "document": "Betterment Dispute Letter",
        "details": "Insurers cannot charge for 'betterment' unless the repair actually improves the property beyond pre-loss condition. Request detailed breakdowns and challenge improper betterment charges."
      },
      {
        "title": "Deductible Dispute",
        "summary": "Verify deductible amount; check for multiple deductibles applied.",
        "document": "Deductible Verification Request",
        "details": "Verify your deductible amount and ensure no multiple deductibles are being applied. Some policies have separate deductibles for different perils that may not apply to your claim."
      },
      {
        "title": "Scope Creep",
        "summary": "Document additional damage discovered; request supplement.",
        "document": "Supplement Request",
        "details": "When additional damage is discovered during repairs, document everything and request a supplement. Insurers are obligated to pay for all damage caused by the covered peril."
      },
      {
        "title": "Emergency Services Denial",
        "summary": "Cite emergency services coverage; provide contractor emergency rates.",
        "document": "Emergency Services Coverage Request",
        "details": "Most policies cover emergency services to prevent further damage. Document the emergency nature of the work and provide contractor emergency rates to justify higher costs."
      },
      {
        "title": "Contents Inventory Dispute",
        "summary": "Provide detailed inventory; challenge depreciation rates.",
        "document": "Contents Inventory Appeal",
        "details": "Provide detailed inventories with purchase dates and current values. Challenge excessive depreciation rates and request replacement cost for items less than 5 years old."
      },
      {
        "title": "Temporary Housing Denial",
        "summary": "Cite ALE coverage; provide rental market analysis.",
        "document": "Additional Living Expenses Request",
        "details": "Additional Living Expenses (ALE) coverage pays for temporary housing when your home is uninhabitable. Provide rental market analysis to justify reasonable costs."
      },
      {
        "title": "Expert Opinion Dispute",
        "summary": "Request independent expert; challenge insurer's expert qualifications.",
        "document": "Independent Expert Request",
        "details": "You have the right to independent experts. Challenge the insurer's expert qualifications and request your own expert evaluation at the insurer's expense."
      },
      {
        "title": "Policy Limit Concerns",
        "summary": "Review policy limits; request coverage analysis.",
        "document": "Coverage Analysis Request",
        "details": "Review your policy limits and request a detailed coverage analysis. Ensure all applicable coverage is being considered, including extended coverage and endorsements."
      },
      {
        "title": "Timeline Violations",
        "summary": "Document all delays; cite state insurance regulations.",
        "document": "Regulatory Complaint",
        "details": "Document all delays and cite specific state insurance regulations. Most states have strict timelines for claim handling that insurers must follow."
      }
    ]
  },
  {
    "category": "Commercial & Business Interruption",
    "situations": [
      {
        "title": "Business Income Denial",
        "summary": "Provide P&L statements; document revenue projections.",
        "document": "Business Income Documentation",
        "details": "Business income coverage requires detailed financial documentation. Provide profit and loss statements, tax returns, and revenue projections to establish your business income claim."
      },
      {
        "title": "Extra Expense Dispute",
        "summary": "Document all extra expenses; justify necessity.",
        "document": "Extra Expense Documentation",
        "details": "Extra expense coverage pays for costs to minimize business interruption. Document all expenses and justify their necessity in maintaining business operations."
      },
      {
        "title": "Period of Restoration Dispute",
        "summary": "Provide contractor timeline; challenge insurer's timeline.",
        "document": "Restoration Timeline Analysis",
        "details": "The period of restoration determines how long business income coverage applies. Provide contractor timelines and challenge any unrealistic restoration periods set by the insurer."
      },
      {
        "title": "Civil Authority Coverage",
        "summary": "Cite civil authority orders; document business closures.",
        "document": "Civil Authority Coverage Request",
        "details": "Civil authority coverage applies when government orders prevent access to your business. Cite specific orders and document how they prevented business operations."
      },
      {
        "title": "Dependent Property Coverage",
        "summary": "Document supplier/customer relationships; prove dependency.",
        "document": "Dependent Property Analysis",
        "details": "Dependent property coverage applies when your business depends on other properties. Document supplier and customer relationships to prove dependency."
      },
      {
        "title": "Extended Period of Indemnity",
        "summary": "Document market conditions; justify extended coverage.",
        "document": "Extended Indemnity Request",
        "details": "Extended period of indemnity coverage applies when business takes longer to recover than expected. Document market conditions and justify why extended coverage is needed."
      },
      {
        "title": "Contingent Business Income",
        "summary": "Document supplier/customer damage; prove business impact.",
        "document": "Contingent Business Income Claim",
        "details": "Contingent business income coverage applies when suppliers or customers are damaged. Document the damage and prove how it impacts your business operations."
      },
      {
        "title": "Employee Wages Dispute",
        "summary": "Provide payroll records; justify wage continuation.",
        "document": "Employee Wage Documentation",
        "details": "Business income coverage may include employee wages. Provide payroll records and justify why wage continuation is necessary for business recovery."
      },
      {
        "title": "Rent/Lease Disputes",
        "summary": "Document lease obligations; prove continuing expenses.",
        "document": "Lease Obligation Documentation",
        "details": "Business income coverage includes continuing lease obligations. Document lease terms and prove that rent payments continue during the restoration period."
      },
      {
        "title": "Utility Expenses",
        "summary": "Document utility costs; justify continuing expenses.",
        "document": "Utility Expense Documentation",
        "details": "Business income coverage may include continuing utility expenses. Document utility costs and justify why these expenses continue during restoration."
      },
      {
        "title": "Professional Services",
        "summary": "Document professional fees; justify necessity.",
        "document": "Professional Services Documentation",
        "details": "Business income coverage may include professional services needed for business recovery. Document fees and justify their necessity for business operations."
      },
      {
        "title": "Marketing/Advertising",
        "summary": "Document marketing costs; justify business recovery.",
        "document": "Marketing Expense Documentation",
        "details": "Business income coverage may include marketing and advertising costs needed for business recovery. Document costs and justify their role in business recovery."
      },
      {
        "title": "Inventory Loss",
        "summary": "Document inventory values; challenge depreciation.",
        "document": "Inventory Loss Documentation",
        "details": "Business income coverage may include inventory losses. Document inventory values and challenge excessive depreciation rates applied by the insurer."
      },
      {
        "title": "Equipment Rental",
        "summary": "Document rental costs; justify temporary equipment.",
        "document": "Equipment Rental Documentation",
        "details": "Business income coverage may include equipment rental costs for temporary operations. Document rental costs and justify the necessity of temporary equipment."
      },
      {
        "title": "Relocation Expenses",
        "summary": "Document relocation costs; justify temporary location.",
        "document": "Relocation Expense Documentation",
        "details": "Business income coverage may include relocation expenses for temporary operations. Document costs and justify the necessity of a temporary location."
      },
      {
        "title": "Contract Cancellation",
        "summary": "Document contract losses; prove business impact.",
        "document": "Contract Loss Documentation",
        "details": "Business income coverage may include losses from cancelled contracts. Document contract losses and prove how they impact business operations."
      }
    ]
  },
  {
    "category": "Catastrophe / Disaster",
    "situations": [
      {
        "title": "Hurricane Damage Assessment",
        "summary": "Document all hurricane damage; separate wind vs flood damage.",
        "document": "Hurricane Damage Documentation",
        "details": "Hurricane damage requires careful documentation to separate wind damage (covered) from flood damage (may require separate coverage). Document all damage immediately after the storm."
      },
      {
        "title": "Flood Coverage Dispute",
        "summary": "Review flood policy; document flood vs wind damage.",
        "document": "Flood Coverage Analysis",
        "details": "Flood damage requires separate flood insurance. Review your flood policy and carefully document what damage is from flooding versus wind to ensure proper coverage."
      },
      {
        "title": "Wildfire Damage",
        "summary": "Document fire damage; separate smoke vs fire damage.",
        "document": "Wildfire Damage Documentation",
        "details": "Wildfire damage requires careful documentation of fire damage versus smoke damage. Both may be covered, but require different documentation approaches."
      },
      {
        "title": "Earthquake Damage",
        "summary": "Document structural damage; separate earthquake vs other causes.",
        "document": "Earthquake Damage Documentation",
        "details": "Earthquake damage requires separate earthquake insurance. Document all structural damage and separate earthquake damage from other potential causes."
      },
      {
        "title": "Tornado Damage",
        "summary": "Document wind damage; separate tornado vs other wind.",
        "document": "Tornado Damage Documentation",
        "details": "Tornado damage is typically covered under windstorm coverage. Document all wind damage and separate tornado damage from other wind events."
      },
      {
        "title": "Hail Damage",
        "summary": "Document hail damage; provide weather reports.",
        "document": "Hail Damage Documentation",
        "details": "Hail damage requires specific documentation including weather reports and damage photos. Document all hail damage immediately as it can be difficult to prove later."
      },
      {
        "title": "Ice Storm Damage",
        "summary": "Document ice damage; separate ice vs other causes.",
        "document": "Ice Storm Damage Documentation",
        "details": "Ice storm damage requires careful documentation to separate ice damage from other potential causes. Document all damage and provide weather reports."
      },
      {
        "title": "Blizzard Damage",
        "summary": "Document snow/ice damage; separate weather vs other causes.",
        "document": "Blizzard Damage Documentation",
        "details": "Blizzard damage requires documentation of snow and ice damage. Separate weather-related damage from other potential causes and provide weather reports."
      },
      {
        "title": "Drought Damage",
        "summary": "Document drought damage; separate drought vs other causes.",
        "document": "Drought Damage Documentation",
        "details": "Drought damage requires careful documentation to separate drought-related damage from other potential causes. Document all damage and provide weather reports."
      },
      {
        "title": "Heat Wave Damage",
        "summary": "Document heat damage; separate heat vs other causes.",
        "document": "Heat Wave Damage Documentation",
        "details": "Heat wave damage requires documentation of heat-related damage. Separate heat damage from other potential causes and provide weather reports."
      },
      {
        "title": "Severe Storm Damage",
        "summary": "Document storm damage; separate storm vs other causes.",
        "document": "Severe Storm Damage Documentation",
        "details": "Severe storm damage requires careful documentation to separate storm-related damage from other potential causes. Document all damage and provide weather reports."
      },
      {
        "title": "Lightning Damage",
        "summary": "Document lightning damage; provide electrical damage evidence.",
        "document": "Lightning Damage Documentation",
        "details": "Lightning damage requires specific documentation including electrical damage evidence. Document all electrical damage and provide evidence of lightning strikes."
      },
      {
        "title": "Power Outage Damage",
        "summary": "Document power outage damage; separate power vs other causes.",
        "document": "Power Outage Damage Documentation",
        "details": "Power outage damage requires documentation of damage caused by power outages. Separate power-related damage from other potential causes."
      },
      {
        "title": "Water Damage from Storms",
        "summary": "Document water damage; separate storm vs flood damage.",
        "document": "Storm Water Damage Documentation",
        "details": "Water damage from storms requires careful documentation to separate storm-related water damage from flood damage. Both may have different coverage requirements."
      },
      {
        "title": "Debris Removal",
        "summary": "Document debris removal costs; justify necessity.",
        "document": "Debris Removal Documentation",
        "details": "Debris removal coverage pays for removing debris from covered damage. Document all debris removal costs and justify their necessity for property restoration."
      },
      {
        "title": "Emergency Repairs",
        "summary": "Document emergency repairs; justify necessity.",
        "document": "Emergency Repair Documentation",
        "details": "Emergency repair coverage pays for temporary repairs to prevent further damage. Document all emergency repairs and justify their necessity for property protection."
      }
    ]
  }
]
